//alt+shift+f可以格式化代码样式
//充当本地的数据库文件
var news_data = [
  {
    date: "Sep 18 2018",
    title: "巧手爸爸变废为宝 落叶变“艺术品",
    imgSrc: "/images/news/crab.png",
    avatar: "/images/avatar/1.png",
    content: "11月16日报道，在山东济南，一位爸爸为哄孩子开心，从街头捡10余袋各种树叶，其中将枫叶、银杏等落叶变废为宝，为孩子制作成各种绝美创意的画作，这一暖心的做法令孩子十分开心",
    reading: "112",
    collection: "96",
    headImgSrc: "/images/news/crab.png",
    author: "张三",
    dateTime: "24小时前",
    detail: "11月16日报道，在山东济南，一位爸爸为哄孩子开心，从街头捡10余袋各种树叶，其中将枫叶、银杏等落叶变废为宝，为孩子制作成各种绝美创意的画作，这一暖心的做法令孩子十分开心11月16日报道，在山东济南，一位爸爸为哄孩子开心，从街头捡10余袋各种树叶，其中将枫叶、银杏等落叶变废为宝，为孩子制作成各种绝美创意的画作，这一暖心的做法令孩子十分开心11月16日报道，在山东济南，一位爸爸为哄孩子开心，从街头捡10余袋各种树叶，其中将枫叶、银杏等落叶变废为宝，为孩子制作成各种绝美创意的画作，这一暖心的做法令孩子十分开心.\r\n\n 11月16日报道，在山东济南，一位爸爸为哄孩子开心，从街头捡10余袋各种树叶，其中将枫叶、银杏等落叶变废为宝，为孩子制作成各种绝美创意的画作，这一暖心的做法令孩子十分开心11月16日报道，在山东济南，一位爸爸为哄孩子开心，从街头捡10余袋各种树叶，其中将枫叶、银杏等落叶变废为宝，为孩子制作成各种绝美创意的画作，这一暖心的做法令孩子十分开心11月16日报道，在山东济南，一位爸爸为哄孩子开心，从街头捡10余袋各种树叶，其中将枫叶、银杏等落叶变废为宝，为孩子制作成各种绝美创意的画作，这一暖心的做法令孩子十分开心.",
    newsId: 0,
    music: {
      url: "https://m10.music.126.net/20181126173403/28acb6582d8187aa44735c7690732100/ymusic/edf5/9690/0a43/d5529afb96e370a7c71be1b8fa8688d8.mp3",
      title: "原来你也在这里-周笔畅",
      coverImg: "https://p2.music.126.net/qppSA-tF_S0SAkastKDpxA==/109951163626553866.jpg?param=130y130"
    }
  },
  {
    title: "比利·林恩的中场故事",
    content: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》...",
    imgSrc: "/images/news/bl.png",
    reading: 62,
    detail: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性”李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。预告片首次曝光后，被视作是明年奥斯卡种子选手。该片根据同名畅销书改编。原著小说荣获美国国家图书奖。也被BBC评为21世纪最伟大的12本英文小说之一。影片讲述一位19岁德州男孩的比利·林恩入伍参加伊战，在一次交火中他大难不死，意外与战友成为大众的关注焦点，并被塑造成英雄。之后他们返回国内，在橄榄球赛中场休息时授勋。这名战争英雄却面临前所未有的心灵煎熬……李安为什么选中这部电影来拍？因为李安想要挑战前所未有的技术难题：以120帧每秒的速度、4K、3D技术全面结合，来掀起一场电影视觉革命。什么意思？所谓“电影是24格每秒的谎言”，其中的24格，就是帧数。\r\n\n 在一次交火中他大难不死，意外与战友成为大众的关注焦点，并被塑造成英雄。之后他们返回国内，在橄榄球赛中场休息时授勋。这名战争英雄却面临前所未有的心灵煎熬……李安为什么选中这部电影来拍？因为李安想要挑战前所未有的技术难题：以120帧每秒的速度、4K、3D技术全面结合，来掀起一场电影视觉革命。什么意思？所谓“电影是24格每秒的谎言”，其中的24格，就是帧数",
    collection: 92,
    dateTime: "24小时前",
    headImgSrc: "/images/news/bl.png",
    author: "李四",
    date: "Nov 20 2018",
    avatar: "/images/avatar/2.png",
    newsId: 1,
    music: {
      url: "https://m10.music.126.net/20181126173615/03565d2af3dd57a72a2388ef148af71a/ymusic/520f/0309/0109/ee0d951e364c4b3300db6c727cfff5dd.mp3",
      title: "我们-陈奕迅",
      coverImg: "https://p2.music.126.net/Ng7OR-bdgrHQKXzLyj2mGg==/109951163240732641.jpg?param=130y130"
    }
  },
  {
    //按住alt + shift + F 可以格式化代码样式
    title: "当我们在谈论经济学时，我们在谈论什么?",
    content: "引言在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：...",
    detail: "1 引言\n\n在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里：\r\n\n2 ”简笔素描“与”油画肖像“我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。\n\n2.1 ”简笔素描“对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素",
    imgSrc: "/images/news/sls.png",
    headImgSrc: "/images/news/sls.png",
    reading: 62,
    collection: 92,
    author: "王五",
    date: "Nov 12 2018",
    dateTime: "三天前",
    avatar: "/images/avatar/3.png",
    newsId: 2,
    music: {
      url: "https://m10.music.126.net/20181120111922/9634aebe27156fc22338d86d1c52d551/ymusic/2242/0271/8dd1/b6da3ffc8d2561b321284004c81da136.mp3",
      title: "年少有为-李荣浩",
      coverImg: "https://p2.music.126.net/umoBJWQM2hDe_DB1i2pA0A==/109951163437040183.jpg?param=130y130"
    }
  },
  {
    title: "风味人间",
    content: "腾讯视频大型自制纪录片《风味人间》将讲述全球范围内以美食为线索的人文故事。在全球视野里审视中国美食的独特性,在历史演化过程中探究中国美食的...",
    imgSrc: "/images/news/xiaolong.png",
    reading: 102,
    detail: "《风味人间》既有针对中国美食流变进程的梳理，也有讲述国外舶来品对中国食物的影响与融合，以及华人用自己的独特美食风味开疆拓土融入不同的文化。《风味人间》也是观众和美食新一次的连接纽带，共同探知神秘的味觉大陆和其他同类美食纪录片相比，《风味人间》最大的特点就在于它的世界性，不只是讲中国的美食。摄制组跨越六大洲二十多个地区，收录了许多国外美食。整部纪录片中国内容占70%，国外内容占到30%。\r\n\n 《风味人间》既有针对中国美食流变进程的梳理，也有讲述国外舶来品对中国食物的影响与融合，以及华人用自己的独特美食风味开疆拓土融入不同的文化。《风味人间》也是观众和美食新一次的连接纽带，共同探知神秘的味觉大陆和其他同类美食纪录片相比，《风味人间》最大的特点就在于它的世界性，不只是讲中国的美食。摄制组跨越六大洲二十多个地区，收录了许多国外美食。整部纪录片中国内容占70%，国外内容占到30%",
    collection: 92,
    dateTime: "24小时前",
    headImgSrc: "/images/news/xiaolong.png",
    author: "春花",
    date: "Sep 20 2018",
    avatar: "/images/avatar/4.png",
    newsId: 3,
    music: {
      url: "https://m10.music.126.net/20181120112102/87236965fb552dc595c71e61aee4c641/ymusic/afec/8b3a/6745/ec2c0046e5a80032f377012448795bb2.mp3",
      title: "不染-毛不易",
      coverImg: "https://p1.music.126.net/gEia-o05FSas8uJos54Sug==/109951163456726954.jpg?param=130y130",
    }
  },
  {
    title: "从视觉到触觉 这款VR手套能给你真实触感",
    content: "8月29日消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品...",
    imgSrc: "/images/news/vr.png",
    reading: 102,
    detail: "消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品。该产品名为“Dexmo”，它是一款像手套那样戴在手上使用的未来主义外骨骼。它内置大量的元件，能够与VR体验进行交互，可帮助你感觉握在你的双手的虚拟物体。Dexmo据Dexta称，“Dexmo是一款针对你的双手的机械外骨骼。它能够捕捉你的手部运动，以及提供即时的力反馈。有了Dexmo，你可以感受到虚拟物体的大小、形状和坚硬度。你可以接触数字世界。”市面上已经有数款产品旨在处理虚拟现实中的手部交互，也有相关的产品即将要进入市场。例如，颇受欢迎的HTC Vive头盔配有一副控制器，其控制器能够使得追踪系统看到你的双手，让你可以用它们来在特定体验中与物体进行交互。今年晚些时候，Oculus将开始出货类似的手部控制产品Oculus Touch。10月，索尼也将开始出货配备两个PlayStation Move手部控制器的PS VR。Leap Motion甚至更进一步：利用传感器来追踪手指和手部的运动。",
    collection: 26,
    dateTime: "24小时前",
    headImgSrc: "/images/news/vr.png",
    author: "酸菜",
    date: "Nov 24 2018",
    avatar: "../../../images/avatar/5.png",
    newsId: 4,
    music: {
      url: "https://m10.music.126.net/20181120112150/0a2c13cabb4810a743bbbf3bc7fc1007/ymusic/0315/6567/aec4/571c53753324f59988788fe518798f66.mp3",
      title: "可能否-沐小雅",
      coverImg: "https://p2.music.126.net/SJYnDay7wgewU3O7tPfmOQ==/109951163322541581.jpg?param=130y130"
    }
  },
  {
    title: "深氪｜微信小程序被高估了吗？",
    content: "昙花一现、过眼云烟。”这就是今年很多爆款小程序的命运。尤其那些短小精悍的娱乐型小程序，长则3个月、短则1周，就从大家视线里面消失了。",
    imgSrc: "/images/iqiyi.png",
    reading: 96,
    detail: "“昙花一现、过眼云烟。”这就是今年很多爆款小程序的命运。尤其那些短小精悍的娱乐型小程序，长则3个月、短则1周，就从大家视线里面消失了。“我没有估计到，火得这么快，又掉得这么快。” 回想起大年三十，一堆投资人坐在小程序创始人公司门口等着抢项目的情形，熊猫资本董事总经理谷承文如今觉得“很不正常”。因为来不及和团队有充分沟通，对方根本不可能提供很多数据，就要基于不充分的信息做决策，往往一周就close了，甚至要当天打定金，所以“我当时是特别难受的”。微信小程序的热度在2018年春节前后酝酿，到7月拼多多上市达到顶峰，但现在，“整个投资行业都悲观了。”一位小程序创业者说，因为“上半年投资的小程序都没有交出很好的答卷。",
    collection: 26,
    dateTime: "21小时前",
    headImgSrc: "/images/iqiyi.png",
    author: "叉烧",
    date: "Nov 28 2018",
    avatar: "../../../images/avatar/1.png",
    newsId: 5,
    music: {
      url: "https://m10.music.126.net/20181120112254/3147bc74fa02b655ca7734cb14e1191f/ymusic/a391/279d/1655/ebc8f929b98e7b29f9e5adc0a31df24f.mp3",
      title: "红色高跟鞋-蔡健雅",
      coverImg: "https://p2.music.126.net/2toWuH2oD6c0dM6QLdThzg==/109951163165824418.jpg?param=130y130"
    }
  },
]
//定义出口，模块输出
module.exports = {
  newsList: news_data
}